# DestinationLinetypeName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeInfo..::..DestinationLinetypeName Property
ExportLinetypeInfo Class See Also
---
The destination linetype name (the name of the linetype in the exported format).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string DestinationLinetypeName { get; set; }
```

Visual Basic
---
```text
Public Property DestinationLinetypeName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ DestinationLinetypeName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ExportLinetypeInfo Class
Autodesk.Revit.DB Namespace